<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a self installer pkg for EndNote</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.pkg.EndNote-self-install</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EndNoteX9</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.EndNoteX9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>scripts</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/scripts</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FlatPkgPacker</string>
			<key>Arguments</key>
			<dict>
				<key>destination_pkg</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-self-install.pkg</string>
				<key>source_flatpkg_dir</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
