<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads balenaEtcher from Github. If you run this recipe as is, it will download v.1.4.4, which has not been updated since April 2018. At the time of writing, all subsequent releases are tagged as pre-releases. If you want the most recent version of the app, you should set PRERELEASE to a non-empty string, either with Input in an override or via the -k option, i.e. `-k PRERELEASE=yes`</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.Etcher</string>
	<key>Input</key>
	<dict>
		<key>PRERELEASE</key>
		<string></string>
		<key>NAME</key>
		<string>balenaEtcher</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>%NAME%-[\S]+\.dmg</string>
				<key>github_repo</key>
				<string>balena-io/etcher</string>
				<key>include_prereleases</key>
				<string>%PRERELEASE%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/balenaEtcher.app</string>
					<key>requirement</key>
					<string>identifier "io.balena.etcher" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "66H43P8FRG"</string>
				</dict>
		</dict>
	</array>
</dict>
</plist>
