<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Mosh from Brew Cask</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.mosh</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Mosh</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>BrewCaskInfoProvider</string>
			<key>Arguments</key>
			<dict>
			<key>cask_name</key>
			<string>mosh</string>
			</dict>
		</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>