<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of PlistEditPro from FatCatSoftware.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.plisteditpro</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PlistEditPro</string>
		<key>DOWNLOAD_URL</key>
		<string>http://www.fatcatsoftware.com/plisteditpro/PlistEditPro.zip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>url</key>
			<string>%DOWNLOAD_URL%</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>