<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of iShowU Instant. The .dmg includes the main .app and the supplemental Audio Capture .pkg. This recipe runs CodeSignatureVerifier on both.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.ishowuinstant</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>iShowUInstant</string>
		<key>APPNAME</key>
		<string>iShowU Instant</string>
		<key>PKGNAME</key>
		<string>iShowU Audio Capture</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>https://www.shinywhitebox.com/store/appcast.php?p=14</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%APPNAME%.app</string>
				<key>requirements</key>
				<string>identifier "com.shinywhitebox.iShowU-Instant" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PMJ275ZTUX</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%PKGNAME%.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Shiny White Box Limited (PMJ275ZTUX)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
