<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and imports the latest version of iShowU Instant and the iShowU Audio Capture package into Munki. This sets Audio Capture as an update_for iShowU Instant.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.munki.ishowuinstant</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>iShowUInstant</string>
		<key>APP_NAME</key>
		<string>iShowU Instant</string>
		<key>DESCRIPTION</key>
		<string>Realtime screen recording. Features include live preview, customizable presets and scheduled recordings.</string>
		<key>DISPLAY_NAME</key>
		<string>%APP_NAME%</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/iShowUInstant</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Audio-Visual</string>
			<key>description</key>
			<string>%DESCRIPTION%</string>
			<key>DISPLAY_NAME</key>
			<string>%DISPLAY_NAME%</string>
			<key>developer</key>
			<string>shinywhitebox</string>
			<key>name</key>
			<string>%NAME%</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.ishowuinstant</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
