<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and creates a package for the latest release version of uTorrent.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.utorrent.pkg</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>uTorrent</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>utorrent.download.recipe</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
                <string>%pathname%/uTorrent.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/uTorrent.app</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%pkgroot%/Applications/%NAME%.app/Contents/Info.plist</string>
				<key>plist_keys</key>
					<dict>
						<key>CFBundleShortVersionString</key>
						<string>version</string>
						<key>CFBundleIdentifier</key>
						<string>versions</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>pkgroot</key>
						<string>%pkgroot%</string>
						<key>pkgname</key>
						<string>%NAME%</string>
						<key>id</key>
						<string>%version%</string>
						<key>version</key>
						<string>%version%</string>
						<key>chown</key>
						<array>
							<dict>
								<key>path</key>
								<string>Applications</string>
								<key>user</key>
								<string>root</string>
								<key>group</key>
								<string>admin</string>
							</dict>
						</array>
					</dict>
				</dict>
			</dict>
			<dict>
        		<key>Processor</key>
        		<string>EndOfCheckPhase</string>
        	</dict>
    	</array>
	</dict>
</plist>
