<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release version of uTorrent</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.utorrent</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>uTorrent</string>
		<key>DOWNLOAD_URL</key>
		<string>http://www.utorrent.com/downloads/mac</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>CURLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>re_pattern</key>
				<string>http://download.ap.bittorrent.com/track/stable/endpoint/utmac/os/osx</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%match%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
					<dict>
						<key>input_path</key>
						<string>%pathname%/%NAME%.app</string>
						<key>requirement</key>
						<string>anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = SNBT6M4A7T</string>
					</dict>
			</dict>
		</array>
	</dict>
</plist>
