<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Create a package from the Kodi DMG.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.pkg.kodi</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>kodi.download.recipe</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
						<key>pkgroot</key>
						<string>%RECIPE_CACHE_DIR%/%NAME%</string>
						<key>pkgdirs</key>
						<dict>
								<key>Applications</key>
								<string>0775</string>
						</dict>
				</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
				<key>source_path</key>
				<string>%pathname%/%NAME%.app</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pkgroot%/Applications/%NAME%.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
		</dict>
</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%pkgroot%</string>
					<key>pkgname</key>
					<string>%NAME%</string>
					<key>id</key>
					<string>org.xbmc.kodi</string>
					<key>version</key>
					<string>%version%</string>
					<key>chown</key>
					<array>
						<dict>
								<key>path</key>
								<string>Applications</string>
								<key>user</key>
								<string>root</string>
								<key>group</key>
								<string>admin</string>
						</dict>
				</array>
				</dict>
			</dict>
		</dict>
</array>
</dict>
</plist>
