<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current version of LastFM from the LastFM website.</string>
    <key>Identifier</key>
    <string>com.github.andrewvalentine.download.lastfm</string>
    <key>Input</key>
    <dict>
    	<key>NAME</key>
    	<string>LastFM</string>
    	<key>DOWNLOAD_URL</key>
    	<string>http://www.last.fm/download/mac</string>
    </dict>
		<key>MinimumVersion</key>
    	<string>2.0</string>
    	<key>Process</key>
    	<array>
    		<dict>
            	<key>Processor</key>
            	<string>URLDownloader</string>
            	<key>Arguments</key>
            <dict>
            	<key>url</key>
            	<string>%DOWNLOAD_URL%</string>
            	</dict>
        	<dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
