<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Twitterrific from brew-cask.</string>
    <key>Identifier</key>
    <string>com.github.andrewvalentine.download.twitterrific</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Twitterrific</string>
		<key>cask_name</key>
		<string>twitterrific</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>BrewCaskInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>cask_name</key>
				<string>twitterrific</string>
				<key>url</key>
				<string>https://iconfactory.com/assets/software/twitterrific/Twitterrific-#{version}.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>