<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and installs the current release version of Twitterrific from brew-cask.</string>
    <key>Identifier</key>
    <string>com.github.andrewvalentine.install.twitterrific</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Twitterrific</string>
		</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.twitterrific</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>destinaton_path</key>
				<string>/Applications/</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
		