<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and installs the latest release of Twitteriffic.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.install.twitteriffic</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Twitteriffic</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.twitterrific</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>/Applications/</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
