<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and imports the current release version of Twitterrific into Munki.</string>
    <key>Identifier</key>
    <string>com.github.andrewvalentine.munki.twitterrific</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Twitterrific</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/twitterrific</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
				<key>description</key>
				<string>Twitterrific is the friendly, award-winning Twitter client that's beautiful to look at, easy to use and full of elegant features.</string>
				<key>display_name</key>
				<string>Twitterrific</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
		</dict>
	</dict>
		<key>MinimumVersion</key>
		<string>0.4.0</string>
		<key>ParentRecipe</key>
		<string>com.github.andrewvalentine.download.twitterrific</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>DmgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>dmg_root</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				</dict>
				<dict>
					<key>Arguments</key>
						<dict>
							<key>pkg_path</key>
							<string>%dmg_path%</string>
							<key>repo_subdirectory</key>
							<string>%MUNKI_REPO_SUBDIR%</string>
						</dict>
						<key>Processor</key>
						<string>MunkiImporter</string>
					</dict>
				</dict>
			</array>
		</dict>
	</plist>