<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and installs the latest release version of Kodi.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.install.kodi-release</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Kodi</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.kodi-release</string>
	<key>Process</key>
	<array>
			<dict>
					<key>Processor</key>
					<string>InstallFromDMG</string>
					<key>Arguments</key>
					<dict>
						<key>dmg_path</key>
						<string>%pathname%</string>
						<key>items_to_copy</key>
						<array>
							<dict>
								<key>source_item</key>
								<string>Kodi.app</string>
								<key>destination_path</key>
								<string>/Applications/</string>
							</dict>
						</array>
					</dict>
				</dict>
				<dict>
					<key>Processor</key>
					<string>EndOfCheckPhase</string>
				</dict>
			</array>
		</dict>
	</plist>
