<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release version of Kodi.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.kodi</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Kodi</string>
		<key>DOWNLOAD_URL</key>
		<string>https://kodi.tv/download/</string>
		<key>SEARCH_PATTERN</key>
		<string>[^"]+\.dmg[^"]*</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<!--v.16.0 is not codesigned. This step will be re-added as and when the vendor sorts this out.-->
		<!--<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%NAME%.app</string>
				<key>requirement</key>
				<string>cdhash H"db3a5bd02ace92e09f4fb3d2eff4daec180db055"</string>
			</dict>
		</dict>-->
	</array>
</dict>
</plist>
