<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and imports the current release version of Final Cut Library Manager into Munki</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.munki.final-cut-library-manager</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Final Cut Library Manager</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/final-cut-library-manager</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>Housekeeping for your Final Cut Libraries. Final Cut Library Manager instantly displays all of the Final Cut Pro X libraries that it finds on your Spotlight-indexed drives.</string>
			<key>developer</key>
			<string>Arctic Whiteness</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>FinalCutLibraryManager</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.final-cut-library-manager</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/downloads/Final Cut Library Manager.app</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>MUNKI_REPO</key>
				<string>%MUNKI_REPO%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
