<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and installs the latest version of Final Cut Library Manager</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.install.final-cut-library-manager</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Final Cut Library Manager</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.macvfx.download.FinalCutLibraryManager</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/Final Cut Library Manager.app</string>
				<key>destination_path</key>
				<string>/Applications/Final Cut Library Manager.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>
