<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads, packages and installs the latest version of Texts. Note that Pandoc (https://github.com/jgm/pandoc/releases) is required for Texts to operate. AutoPkg recipes for Pandoc are available from jleggat-recipes.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.install.texts</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Texts</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.andrewvalentine.pkg.texts</string>
    <key>Process</key>
    <array>
		<dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
