<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Texts. A license is required for use beyond the 30 day trial period (http://www.texts.io/purchase/). Note that Pandoc (https://github.com/jgm/pandoc/releases) is required for Texts to operate. AutoPkg recipes for Pandoc are available from jleggat-recipes.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.texts</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Texts</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>http://www.texts.io/appcast-osx.xml</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Texts.app</string>
				<key>requirements</key>
				<string>identifier "io.texts.Texts" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "79TQE2Q7PH"</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
