<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Gant</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.gant</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Gant</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<!--<dict>
			<key>Processor</key>
			<string>CURLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://dl.ganttproject.biz</string>
				<string>http://www.ganttproject.biz/dl/2.7.1/mac</string>
				<key>re_pattern</key>
				<string>([^$].*?dmg)</string>
				<string>([a-z\-\[0-9.][^$].*?dmg)</string>
				<string>([a-z\-\[0-9.]*\/[a-z]*\-[0-9.][^$]*).dmg</string>
			</dict>
		</dict>-->
		<!--<dict>
			<key>Processor</key>
			<string>CURLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%/%match%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>-->
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://dl.ganttproject.biz/ganttproject-2.7.1/ganttproject-2.7.1-r1924.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>identifier "net.sourceforge.ganttproject" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QDCH4KTVP7</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
