<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and imports the latest version of MestReNova into Munki</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.munki.MestReNova</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MestReNova</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Scientific</string>
			<key>description</key>
			<string>Mnova is a multivendor software suite designed for combined NMR, LC/GC/MS and Electronic and Vibrational Spectroscopic techniques.</string>
			<key>developer</key>
			<string>Mestrelab</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>minimum_os_version<key>
			<string>10.7.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.MestReNova</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
