<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of KisMac2</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.kismac2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>KisMac2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://downloads.igrsoft.com/beta/KisMac2.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.dmg/%NAME%.app</string>
				<key>requirement</key>
				<string>identifier "com.igrsoft.kismac" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: Vitalii Parovishnyk (6RW5R6WG96)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
