<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and imports the current release version of Tuxera into Munki.</string>
    <key>Identifier</key>
    <string>com.github.andrewvalentine.munki.tuxera</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Tuxera-NTFS</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/tuxera</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
				<key>category</key>
				<string>Utilities</string>
				<key>description</key>
				<string>Full read-write compatibility with NTFS-formatted drives on a Mac. Access, edit, store and transfer files hassle-free.</string>
				<key>display_name</key>
				<string>Tuxera-NTFS</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
		</dict>
	</dict>
		<key>MinimumVersion</key>
		<string>0.4.0</string>
		<key>ParentRecipe</key>
		<string>com.github.andrewvalentine.download.tuxera</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
					<dict>
						<key>pkg_path</key>
						<string>%REPO_CACHE_DIR%/%NAME%.dmg</string>
						<key>repo_subdirectory</key>
						<string>%MUNKI_REPO_SUBDIR%</string>
						</dict>
						<key>Processor</key>
						<string>MunkiImporter</string>
					</dict>
				</array>
			</dict>
		</plist>			