<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of KisMac2</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.kismac2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>KisMac2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://downloads.igrsoft.com/beta/KisMac2.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<!--CodeSignatureVerification fails due to obsolescence in $app/Growl.framework-->
	</array>
</dict>
</plist>
