<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of FrontDAW</string>
        <key>Identifier</key>
        <string>com.github.andrewvalentine.download.FrontDAW</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>FrontDAW</string>
        </dict>
        <key>MinimumVersion</key>
        <string>2.3</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
					<key>filename</key>
					<string>%NAME%.zip</string>
                    <key>url</key>
					<string>https://unitedplugins.com/download/download?downloadId=10&amp;platform=mac</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
			<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/*.pkg</string>
                    <key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Vojtech Meluzin (MXXPJAJ3T5)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
