<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Ghostlab 2</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.ghostlab</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Ghostlab</string>
		<key>DOWNLOAD_URL</key>
		<string>http://awesome.vanamco.com/Ghostlab2/downloads/Ghostlab2.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>