<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and imports the current release version of Ghostlab into Munki. A license is required from Vanamco for continued use. Such a license can be deployed as update_for via Munki.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.munki.ghostlab</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Ghostlab</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/ghostlab</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Developer</string>
			<key>description</key>
			<string>Synchronized web development made easy</string>
			<key>developer</key>
			<string>Vanamco</string>
			<key>display_name</key>
			<string>Ghostlab</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.ghostlab</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
