<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and installs the latest version of Hyper</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.install.hyper</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Hyper</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.andrewvalentine.download.hyper</string>
    <key>Process</key>
    <array>
		<dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
				<key>destination_path</key>
				<string>/Applications/Hyper.app</string>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Hyper.app</string>
				<key>overwrite</key>
				<string>true</string>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
