<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and imports the current release version of JD-GUI into Munki</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.munki.jdgui</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>JD-GUI</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/JD-GUI</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Programming</string>
			<key>description</key>
			<string>A standalone graphical utility that displays Java source codes of “.class” files.&lt;br&gt;&lt;br&gt;The project home page can be found &lt;a href="http://jd.benow.ca"&gt;here&lt;/a&gt;.</string>
			<key>developer</key>
			<string>java-decompiler</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash
#
# Copyright (c) 2021, dataJAR Ltd.  All rights reserved.
#

# Info.plist needs amending as per: https://github.com/java-decompiler/jd-gui/issues/346#issuecomment-795047028

if [ -f "/Applications/JD-GUI.app/Contents/Info.plist" ]
then
    /bin/echo "Found/Applications/JD-GUI.app/Contents/Info.plist, amending info.plist..."
    /usr/libexec/PlistBuddy -c "set :JavaX:JVMVersion 1.8.0" /Applications/JD-GUI.app/Contents/Info.plist
fi</string>
            <key>requires</key>
			<array>
				<string>OracleJava8JDK</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.jdgui</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/untar/</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Applications/JD-GUI.app</string>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/untar/*/JD-GUI.app</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/Applications/</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>MUNKI_REPO</key>
				<string>%MUNKI_REPO%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/Applications</string>
                    <string>%RECIPE_CACHE_DIR%/untar</string>
                </array>
            </dict>
        </dict>
	</array>
</dict>
</plist>
