<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and installs the latest release version of Dock Master</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.install.dockmaster</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DockMaster</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.andrewvalentine.download.dockmaster</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
			<key>Arguments</key>
      			<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
