<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Extract the package from the MultiMarkdown download</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.pkg.multimarkdown</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MultiMarkdown</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.multimarkdown</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.dmg/*.mpkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.mpkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
