<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of FB-Mac-Messenger from https://fbmacmessenger.rsms.me and installs to /Applications.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.install.fbmacmessenger</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Messenger</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.andrewvalentine.download.fbmacmessenger</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.app</string>
				<key>destination_path</key>
				<string>/Applications/%NAME%.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
