<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and imports the current version of MOTU MIDI Installer into Munki</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.munki.MotuMidiInstaller</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/MotuMidiInstaller</string>
		<key>NAME</key>
		<string>MotuMidiInstaller</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Audio</string>
			<key>description</key>
			<string>Installs the MOTU Midi Installer package, including ClockWorks.app and the MOTU MIDI Driver kernel extension.</string>
			<key>developer</key>
			<string>MOTU</string>
			<key>display_name</key>
			<string>MOTU MIDI Installer</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.MotuMidiInstaller</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>MUNKI_REPO</key>
				<string>%MUNKI_REPO%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
