<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Etcher-CLI from Github</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.Etcher-CLI</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Etcher-CLI</string>
		<key>ARCHIVE_NAME</key>
		<string>balena-etcher-cli</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>%ARCHIVE_NAME%-[\S]+\-darwin-x64.tar.gz</string>
				<key>github_repo</key>
				<string>balena-io/etcher</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
