<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Vault from Hashicorp</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Vault</string>
		<key>DOWNLOAD_URL</key>
		<string>https://dl.bintray.com/mitchellh/vault/vault_0.1.2_darwin_amd64.zip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>