<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download and installs the current release version of Vault</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.install.vault</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Vault</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.vault</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>/usr/local/bin/</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>