<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Vault and imports into Munki</string>
    <key>Identifier</key>
    <string>com.github.andrewvalentine.munki.vault</string>
    <key>Input</key>
    <dict>
    	<key>MUNKI_REPO_SUBDIR</key>
    	<string>apps/vault</string>
    	<key>NAME</key>
    	<string>Vault</string>
    	<key>pkginfo</key>
    	<dict>
    		<key>catalogs</key>
    		<array>
    			<string>testing</string>
    		</array>
			<key>category</key>
			<string>Server Tools</string>
    		<key>description</key>
    		<string>A tool for managing secrets.</string>
    		<key>display_name</key>
    		<string>Vault</string>
    		<key>name</key>
    		<string>%NAME%</string>
    		<key>unattended_install</key>
    		<true/>
    	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.andrewvalentine.download.vault</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
					<dict>
						<key>pkg_request</key>
						<dict>
							<key>pkgroot</key>
							<string>%RECIPE_CACHE_DIR%/%NAME%</string>
							<key>pkgdir</key>
							<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
							<key>pkgname</key>
							<string>%NAME%</string>
							<key>pkgtype</key>
							<string>flat</string>
							<key>version</key>
							<string>1.0</string>
						</dict>
					</dict>
				<dict>
					<key>Arguments</key>
					<dict>
						<key>pkg_path</key>
						<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
						<key>repo_subdirectory</key>
						<string>%MUNKI_REPO_SUBDIR%</string>
					</dict>
					<key>Processor</key>
					<string>MunkiImporter</string>
				</dict>
			</dict>
			</array>
		</dict>
	</plist>