<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the JabRef Installer from GitHub. The .app bundle is not signed.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.jabref</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>JabRef</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>JabRef/jabref</string>
				<key>asset_regex</key>
				<string>JabRef-[\S]+\.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
