<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and imports the current release version of JabRef into Munki. This recipe appends the required pkginfo to install the application from the downloaded installer .app silently.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.munki.jabref</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>JabRef</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/JabRef</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Reference</string>
			<key>description</key>
			<string>JabRef is an open source bibliography reference manager, which makes use of BibTeX and BibLaTeX as native formats. JabRef provides an interface for editing BibTeX files, for importing data from online scientific databases, and for managing and searching BibTeX files.</string>
			<key>developer</key>
			<string>The JabRef Team</string>
			<key>name</key>
			<string>JabRef</string>
			<key>display_name</key>
			<string>JabRef</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.jabref</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>items_to_copy</key>
					<array>
						<dict>
							<key>source_item</key>
							<string>JabRef Installer.app</string>
							<key>destination_path</key>
							<string>/tmp/</string>
						</dict>
					</array>
					<key>installs</key>
					<array>
						<dict>
							<key>CFBundleIdentifier</key>
							<string>com.install4j.0034-7691-1464-4754.23</string>
							<key>CFBundleName</key>
							<string>JabRef</string>
							<key>CFBundleShortVersionString</key>
							<string>3.5</string>
							<key>CFBundleVersion</key>
							<string>3.5</string>
							<key>minosversion</key>
							<string>10.7.3</string>
							<key>path</key>
							<string>/Applications/JabRef.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleShortVersionString</string>
						</dict>
					</array>
					<key>postinstall_script</key>
					<string>#!/bin/bash

# Run the installer. This replicates the activity of the JabRef Installer.app when run interactively. Options determined from the brew cask recipe (https://github.com/caskroom/homebrew-cask/blob/master/Casks/jabref.rb)
/tmp/JabRef\ Installer.app/Contents/MacOS/JavaApplicationStub -q -V createDesktopLinkAction$Boolean=false -V addToDockAction$Boolean=false -V showFileAction$Boolean=false -V sys.installationDir=/Applications -V executionLauncherAction$Boolean=false

# Cleanup the installer files
/bin/rm -rf /tmp/JabRef\ Installer.app</string>
					<key>uninstall_method</key>
					<string>uninstall_script</string>
					<key>uninstall_script</key>
					<string>#!/bin/bash
/bin/rm -rf /Applications/JabRef.app</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.dmg</string>
					<key>repo_subdirectory</key>
					<string>apps/JabRef</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
