<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and imports the current release version of JabRef into Munki. This recipe appends the required pkginfo to install the application from the downloaded installer .app silently.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.munki.jabref</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Referencing</string>
		<key>DEVELOPER</key>
		<string>The JabRef Team</string>
		<key>DISPLAY_NAME</key>
		<string>JabRef</string>
		<key>DESCRIPTION</key>
		<string>JabRef is an open source bibliography reference manager, which makes use of BibTeX and BibLaTeX as native formats. JabRef provides an interface for editing BibTeX files, for importing data from online scientific databases, and for managing and searching BibTeX files.</string>
		<key>NAME</key>
		<string>JabRef</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/JabRef</string>
		<key>REQUIRES</key>
		<string>OracleJava8</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.jabref</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkginfo</key>
				<dict>
					<key>category</key>
					<string>%CATEGORY%</string>
					<key>description</key>
					<string>%DESCRIPTION%</string>
					<key>developer</key>
					<string>%DEVELOPER%</string>
					<key>display_name</key>
					<string>%DISPLAY_NAME%</string>
					<key>name</key>
					<string>%NAME%</string>
					<key>requires</key>
					<array>
						<string>%REQUIRES%</string>
					</array>
			</dict>
				<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
