<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ocenaudio. 
	
	Use the DOWNLOAD_ARCH Input Variable to specify your required architecture. 
	Values at the time of writing are:

	bigsur_arm64
	bigsur
	</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.ocenaudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ocenaudio</string>
		<key>DOWNLOAD_ARCH</key>
		<string>bigsur</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.ocenaudio.com/downloads/index.php/ocenaudio_%DOWNLOAD_ARCH%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%NAME%.app</string>
				<key>requirement</key>
				<string>identifier "com.ocenaudio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = ZMUMSKSPM6</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
