<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and installs the latest version of XAMPP</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.install.xampp</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>XAMPP</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>xampp.download.recipe</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>/tmp/install-xampp.sh</string>
				<key>file_content</key>
				<string>#/bin/bash

~/Library/AutoPkg/Cache/com.github.andrewvalentine.install.xampp/xampp-osx-5.6.15-1-installer.dmg/Contents/MacOS/installbuilder.sh --mode unattended
				</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
