<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release version of XAMPP</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.xampp</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>XAMPP</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>CURLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.apachefriends.org/index.html</string>
				<key>re_pattern</key>
				<string>[^"]+\.dmg[^"]*</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CURLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%match%</string>
			</dict>
		</dict>
		<dict>
		<key>Processor</key>
		<string>CodeSignatureVerifier</string>
		<key>Arguments</key>
		<dict>
			<key>input_path</key>
			<string>%pathname%/%NAME%.app</string>
			<key>requirements</key>
			<string>anchor apple generic and identifier "com.bitrock.appinstaller" and certificate leaf[subject.OU] = "49P7N62XPM"
host => identifier "com.apple.sh" and anchor apple generic</string>
</dict>
</dict>
<dict>
	<key>Processor</key>
	<string>EndOfCheckPhase</string>
</dict>
</array>
</dict>
</plist>
