<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and installs the latest version of Veracrypt</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.install.VeraCrypt</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VeraCrypt</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.andrewvalentine.pkg.VeraCrypt</string>
    <key>Process</key>
    <array>
			<dict>
				<key>Processor</key>
				<string>Installer</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
