<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates an installable package from the VeraCrypt .dmg. This recipe unpacks and re-flattens the relevant .pkg from the VeraCrypt .dmg.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.pkg.VeraCrypt</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VeraCrypt</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.VeraCrypt</string>
	<key>Process</key>
	<array>
		<dict>
			<!--Unpack the Installer .pkg from the .dmg-->
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkg/</string>
			</dict>
		</dict>
		<dict>
			<!--Flatten the only .pkg we need to run the install-->
			<key>Processor</key>
			<string>FlatPkgPacker</string>
			<key>Arguments</key>
			<dict>
				<key>source_flatpkg_dir</key>
				<string>%RECIPE_CACHE_DIR%/pkg/%NAME%.pkg</string>
				<key>destination_pkg</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
