<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and installs the latest version of KnockKnock</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.install.KnockKnock</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>KnockKnock</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.andrewvalentine.download.KnockKnock</string>
    <key>Process</key>
    <array>
			<dict>
				<key>Processor</key>
				<string>Copier</string>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/KnockKnock.app</string>
					<key>destination_path</key>
					<string>/Applications/KnockKnock.app</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
