<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>TurningPoint is now PointSolutions.

Downloads the latest version of PointSolutions. If you work in a business or educational environment, you should be aware of what version of the software your organization currently supports and is licensed for before using this recipe.</string>
        <key>Identifier</key>
        <string>com.github.andrewvalentine.download.TurningPoint</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>PointSolutions</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://downloads.turning.com/downloads/turningclassic</string>
                    <key>re_pattern</key>
                    <string>https://d2p83s3q5aa83e\.cloudfront\.net/wp-content/software/TurningPoint/.*?\.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%match%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/%NAME%.app</string>
                    <key>requirement</key>
                    <string>identifier "com.turningtechnologies.TurningPoint.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3YF49VXVT5"</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
