<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads, packages and imports the current release version of RawTherapee into Munki</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.munki.RawTherapee</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RawTherapee</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/RawTherapee</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Image Processing</string>
			<key>description</key>
			<string>RawTherapee is a cross-platform raw image processing program, specifically aimed at raw photo post-production.</string>
			<key>developer</key>
			<string>Gábor Horváth</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.pkg.RawTherapee</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
