<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Mac-Linux-USB-Loader</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.mac-linux-usb-loader</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Mac Linux USB Loader</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>SevenBits/Mac-Linux-USB-Loader</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Mac Linux USB Loader.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.sevenbits.Mac-Linux-USB-Loader" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = T47PR9EQY5)</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
