<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads LastFM and imports into Munki</string>
    <key>Identifier</key>
    <string>com.github.andrewvalentine.munki.lastfm</string>
    <key>Input</key>
    <dict>
    	<key>MUNKI_REPO_SUBDIR</key>
    	<string>apps</string>
    	<key>NAME</key>
    	<string>LastFM</string>
    	<key>pkginfo</key>
    	<dict>
    		<key>catalogs</key>
    		<array>
    			<string>testing</string>
    		</array>
    		<key>description</key>
    		<string>Last.fm is a music discovery service that gives you personalised recommendations based on the music you listen to.</string>
    		<key>display_name</key>
    		<string>LastFM</string>
    		<key>name</key>
    		<string>%NAME%</string>
    		<key>unattended_install</key>
    		<true/>
    	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.andrewvalentine.download.lastfm</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</key>
			<dict>
			<key>destination_path</key>
			<string>/tmp/%NAME%</string>
			<key>source_path</key>
			<string>%RECIPE_CACHE_DIR/NAME%</string>
			</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>/tmp/%NAME%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>