<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current version of LastFM via Sparkle. Note that Code Signature Verification is not possible on this .app, as it uses Sealed Resources v.1.</string>
    <key>Identifier</key>
    <string>com.github.andrewvalentine.download.lastfm</string>
    <key>Input</key>
    <dict>
    	<key>NAME</key>
    	<string>LastFM</string>
		<key>APPCAST_URL</key>
		<string>https://cdn.last.fm/client/Mac/updates.xml</string>
    </dict>
	<key>MinimumVersion</key>
    	<string>0.4.2</string>
    	<key>Process</key>
    	<array>
    	    <dict>
            	<key>Processor</key>
            	<string>SparkleUpdateInfoProvider</string>
            	<key>Arguments</key>
            <dict>
            	<key>appcast_url</key>
            	<string>%APPCAST_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
            <dict>
            	<key>Processor</key>
            	<string>EndOfCheckPhase</string>
            </dict>
    </array>
</dict>
</plist>
