<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Flux Center</string>
        <key>Identifier</key>
        <string>com.github.andrewvalentine.download.FluxCenter</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>FluxCenter</string>
        </dict>
        <key>MinimumVersion</key>
        <string>2.3</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://www.flux.audio/download/</string>
                    <key>re_pattern</key>
					<string>https://flux-caffeine.s3.amazonaws.com/files/Flux/CENTER%20%20INSTALLERS/Flux_FluxCenter_MacOS_Installer_.*?\.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%match%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/%NAME%.app</string>
                    <key>requirement</key>
					<string>identifier "audio.flux.FluxCenter.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3FVZ84E75Z"</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
