<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and imports the latest version of Dragonframe to Munki</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.munki.Dragonframe4</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Dragonframe-4</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Video production</string>
			<key>description</key>
			<string>Professional-grade software for stop-motion animation, motion design, and visual effects.</string>
			<key>developer</key>
			<string>DZED Systems</string>
			<key>display_name</key>
			<string>Dragonframe 4</string>
			<key>name</key>
			<string>%NAME%</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>ParentRecipe</key>
	<string>com.github.amsysuk-recipes.download.Dragonframe4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
