<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and installs the latest version of the SuspiciousPackage app</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.install.SuspiciousPackageApp</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SuspiciousPackageApp</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.poundbangbash.eholtam-recipes.download.SuspiciousPackageApp</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
				<array>
					<key>source_item</key>
					<string>Suspicious Package 3.1/Suspicious Package.app</string>
					<key>destination_path</key>
					<string>/Applications/</string>
            	</array>
        	</dict>
		</dict>
   	</array>
</dict>
</plist>
