<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and imports the latest version of SoundGrain into Munki</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.munki.SoundGrain</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SoundGrain</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/SoundGrain</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Audio</string>
			<key>description</key>
			<string>Soundgrain is a graphical interface where users can draw and edit trajectories to control granular sound synthesis.</string>
			<key>developer</key>
			<string>Ajax Sound Studio</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.andrewvalentine.download.SoundGrain</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
