<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of SoundGrain. The .app bundle is not currently codesigned.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.SoundGrain</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SoundGrain</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>CURLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>\A.*(SoundGrain_[\d\.]+\.dmg)</string>
				<key>re_flags</key>
				<array>
					<string>DOTALL</string>
				</array>
				<key>request_headers</key>
                <dict>
                    <key>User-Agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_0) AppleWebKit/600.5.17 (KHTML, like Gecko) Version/8.0.5 Safari/600.5.17</string>
                </dict>
				<key>url</key>
				<string>http://ajaxsoundstudio.com/downloads/</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://ajaxsoundstudio.com/downloads/%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
