<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release of Franz v5 from Github.</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.franz</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Franz</string>
		<key>GITHUB_NAME</key>
		<string>franz</string>
		<key>GITHUB_VERSION</key>
		<string>5.0.0</string>
		<key>RELEASE_VERSION</key>
		<string>beta</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>meetfranz/franz</string>
				<key>asset_regex</key>
				<string>%GITHUB_NAME%-%GITHUB_VERSION%-%RELEASE_VERSION%.[\S]+\.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%NAME%.app</string>
				<key>requirement</key>
				<string>identifier "com.meetfranz.franz" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = TAC9P63ANZ</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
