<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Shadow</string>
	<key>Identifier</key>
	<string>com.github.andrewvalentine.download.Shadow</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Shadow</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://storage.googleapis.com/shadowmocap/ShadowSetup.dmg</string>
				<key>CHECK_FILESIZE_ONLY</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/ShadowSetup.pkg</string>
				<key>expected_authority_names</key>
        		<array>
            		<string>Developer ID Installer: GLI Interactive LLC (54BCU54VM2)</string>
            		<string>Developer ID Certification Authority</string>
            		<string>Apple Root CA</string>
        		</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
